Revit 2027 API
ImporterIFCUtils.GetLocalFileName Method
 Get the local file name, including the path, corresponding to a linked IFC file. This will create a local copy of the IFC file if necessary.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLocalFileName(
	Document aDoc,
	string fileName
)
Public Shared Function GetLocalFileName (
	aDoc As Document,
	fileName As String
) As String
public:
static String^ GetLocalFileName(
	Document^ aDoc,
	String^ fileName
)
static member GetLocalFileName :
        aDoc : Document *
        fileName : string -> string
Parameters
aDoc Document
 The document that will contain the IFC link.
fileName String
 The original file name and path.
Return Value
String
 The local file name and path corresponding to the input file name.
Exceptions
Exception | Condition
ArgumentException |  Can't process file name.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace